<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"e38463b7e46852473c9addaa60982cdd3537f670abc7b0105c5b5e2993c42402","plan_job_ref":"Job Test plan target and replace #425 at https://github.com/dflook/terraform-github-actions/actions/runs/9331436354","plan_out_hash":"2b317351c8bd915602eb8a82ef664159f76764e606ee4ee7d98f5796409e8027","plan_hash":"6a94a2c3ffe86babc01bbcf0bb7c5afc8891673b44b716adf44f12875428f799","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "brBHbnaJC9" -> (known after apply)
!~  foreach = "k7UIFKENej" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #425](https://github.com/dflook/terraform-github-actions/actions/runs/9331436354)